src/main/resources/request/SendCreateVisitRequestMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns:vis="http://schemas.consiliumtechnologies.com/mobile/2009/03/VisitsMessages.xsd" xmlns:vis1="http://schemas.consiliumtechnologies.com/mobile/2009/03/VisitsTypes.xsd" xmlns:com="http://schemas.consiliumtechnologies.com/mobile/2009/03/CommonTypes.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:SendCreateVisitRequestMessage>
            <!--Optional:-->
            <mes:SendMessageRequestInfo>
                <mes:QueueName>?</mes:QueueName>
                <!--Optional:-->
                <mes:CorrelationId>?</mes:CorrelationId>
                <mes:Key>?</mes:Key>
            </mes:SendMessageRequestInfo>
            <!--Optional:-->
            <mes:CreateVisitRequest>
                <vis:Visit>
                    <vis1:Identity>
                        <!--Optional:-->
                        <vis1:Guid>?</vis1:Guid>
                        <vis1:WorkType>?</vis1:WorkType>
                        <vis1:User>
                            <!--Optional:-->
                            <com:Attributes>
                                <!--Zero or more repetitions:-->
                                <com:Attribute>
                                    <!--Optional:-->
                                    <com:Name>?</com:Name>
                                    <!--Optional:-->
                                    <com:Value>?</com:Value>
                                </com:Attribute>
                            </com:Attributes>
                            <!--Optional:-->
                            <com:ID>?</com:ID>
                            <!--Optional:-->
                            <com:Name>?</com:Name>
                            <!--Optional:-->
                            <com:DeviceID>?</com:DeviceID>
                        </vis1:User>
                        <!--Optional:-->
                        <vis1:Company>?</vis1:Company>
                        <vis1:Reference>?</vis1:Reference>
                    </vis1:Identity>
                    <!--Optional:-->
                    <vis1:ClientReference>?</vis1:ClientReference>
                    <vis1:Description>?</vis1:Description>
                    <vis1:Property>
                        <!--Optional:-->
                        <com:Guid>?</com:Guid>
                        <com:Type>?</com:Type>
                        <com:Reference>?</com:Reference>
                        <!--Optional:-->
                        <com:ParentReference>?</com:ParentReference>
                        <com:Name>?</com:Name>
                        <!--Optional:-->
                        <com:Title>?</com:Title>
                        <!--Optional:-->
                        <com:Address>
                            <!--Optional:-->
                            <com:Name>?</com:Name>
                            <com:Lines>
                                <!--Zero or more repetitions:-->
                                <com:AddressLine>?</com:AddressLine>
                            </com:Lines>
                            <!--Optional:-->
                            <com:HouseNo>?</com:HouseNo>
                            <!--Optional:-->
                            <com:PostCode>?</com:PostCode>
                            <!--Optional:-->
                            <com:GeoX>?</com:GeoX>
                            <!--Optional:-->
                            <com:GeoY>?</com:GeoY>
                            <!--Optional:-->
                            <com:URL>?</com:URL>
                        </com:Address>
                        <!--Optional:-->
                        <com:Phone>?</com:Phone>
                        <!--Optional:-->
                        <com:WorkPhone>?</com:WorkPhone>
                        <!--Optional:-->
                        <com:MobilePhone>?</com:MobilePhone>
                        <!--Optional:-->
                        <com:Email>?</com:Email>
                        <!--Optional:-->
                        <com:URL>?</com:URL>
                        <!--Optional:-->
                        <com:Assets>
                            <!--Zero or more repetitions:-->
                            <com:Asset>
                                <com:DefinitionReference>?</com:DefinitionReference>
                                <com:Reference>?</com:Reference>
                                <com:Description>?</com:Description>
                                <!--Optional:-->
                                <com:Details>
                                    <!--Zero or more repetitions:-->
                                    <com:Item>
                                        <!--Optional:-->
                                        <com:Name>?</com:Name>
                                        <!--Optional:-->
                                        <com:Value>?</com:Value>
                                        <com:Reference>?</com:Reference>
                                    </com:Item>
                                </com:Details>
                            </com:Asset>
                        </com:Assets>
                        <!--Optional:-->
                        <com:ExtendedProperties>
                            <!--Optional:-->
                            <com:PreferredName>?</com:PreferredName>
                            <!--Optional:-->
                            <com:ID>?</com:ID>
                            <!--Optional:-->
                            <com:IDLabel>?</com:IDLabel>
                            <!--Optional:-->
                            <com:DateOfBirth>?</com:DateOfBirth>
                            <!--Optional:-->
                            <com:DateOfDeath>?</com:DateOfDeath>
                            <!--Optional:-->
                            <com:Gender>?</com:Gender>
                        </com:ExtendedProperties>
                    </vis1:Property>
                    <!--Optional:-->
                    <vis1:Supervisor>
                        <!--Optional:-->
                        <com:Guid>?</com:Guid>
                        <com:Type>?</com:Type>
                        <com:Reference>?</com:Reference>
                        <!--Optional:-->
                        <com:ParentReference>?</com:ParentReference>
                        <com:Name>?</com:Name>
                        <!--Optional:-->
                        <com:Title>?</com:Title>
                        <!--Optional:-->
                        <com:Address>
                            <!--Optional:-->
                            <com:Name>?</com:Name>
                            <com:Lines>
                                <!--Zero or more repetitions:-->
                                <com:AddressLine>?</com:AddressLine>
                            </com:Lines>
                            <!--Optional:-->
                            <com:HouseNo>?</com:HouseNo>
                            <!--Optional:-->
                            <com:PostCode>?</com:PostCode>
                            <!--Optional:-->
                            <com:GeoX>?</com:GeoX>
                            <!--Optional:-->
                            <com:GeoY>?</com:GeoY>
                            <!--Optional:-->
                            <com:URL>?</com:URL>
                        </com:Address>
                        <!--Optional:-->
                        <com:Phone>?</com:Phone>
                        <!--Optional:-->
                        <com:WorkPhone>?</com:WorkPhone>
                        <!--Optional:-->
                        <com:MobilePhone>?</com:MobilePhone>
                        <!--Optional:-->
                        <com:Email>?</com:Email>
                        <!--Optional:-->
                        <com:URL>?</com:URL>
                        <!--Optional:-->
                        <com:Assets>
                            <!--Zero or more repetitions:-->
                            <com:Asset>
                                <com:DefinitionReference>?</com:DefinitionReference>
                                <com:Reference>?</com:Reference>
                                <com:Description>?</com:Description>
                                <!--Optional:-->
                                <com:Details>
                                    <!--Zero or more repetitions:-->
                                    <com:Item>
                                        <!--Optional:-->
                                        <com:Name>?</com:Name>
                                        <!--Optional:-->
                                        <com:Value>?</com:Value>
                                        <com:Reference>?</com:Reference>
                                    </com:Item>
                                </com:Details>
                            </com:Asset>
                        </com:Assets>
                        <!--Optional:-->
                        <com:ExtendedProperties>
                            <!--Optional:-->
                            <com:PreferredName>?</com:PreferredName>
                            <!--Optional:-->
                            <com:ID>?</com:ID>
                            <!--Optional:-->
                            <com:IDLabel>?</com:IDLabel>
                            <!--Optional:-->
                            <com:DateOfBirth>?</com:DateOfBirth>
                            <!--Optional:-->
                            <com:DateOfDeath>?</com:DateOfDeath>
                            <!--Optional:-->
                            <com:Gender>?</com:Gender>
                        </com:ExtendedProperties>
                    </vis1:Supervisor>
                    <!--Optional:-->
                    <vis1:Status>?</vis1:Status>
                    <!--Optional:-->
                    <vis1:StatusChangeDate>?</vis1:StatusChangeDate>
                    <!--Optional:-->
                    <vis1:CreatedDate>?</vis1:CreatedDate>
                    <!--Optional:-->
                    <vis1:Retrieved>?</vis1:Retrieved>
                    <!--Optional:-->
                    <vis1:RetrievedDate>?</vis1:RetrievedDate>
                    <!--Optional:-->
                    <vis1:PrintedDate>?</vis1:PrintedDate>
                    <!--Optional:-->
                    <vis1:ReceivedDate>?</vis1:ReceivedDate>
                    <!--Optional:-->
                    <vis1:ResponseDate>?</vis1:ResponseDate>
                    <!--Optional:-->
                    <vis1:RequiredDate>?</vis1:RequiredDate>
                    <!--Optional:-->
                    <vis1:Complete>?</vis1:Complete>
                    <!--Optional:-->
                    <vis1:CompletedDate>?</vis1:CompletedDate>
                    <!--Optional:-->
                    <vis1:Appointment>
                        <vis1:Date>?</vis1:Date>
                        <vis1:Slot>?</vis1:Slot>
                        <vis1:Schedule>
                            <com:StartDate>?</com:StartDate>
                            <com:EndDate>?</com:EndDate>
                        </vis1:Schedule>
                        <!--Optional:-->
                        <vis1:Kept>?</vis1:Kept>
                        <!--Optional:-->
                        <vis1:ReasonCode>?</vis1:ReasonCode>
                        <!--Optional:-->
                        <vis1:Narrative>?</vis1:Narrative>
                    </vis1:Appointment>
                    <!--Optional:-->
                    <vis1:Schedule>
                        <com:StartDate>?</com:StartDate>
                        <com:EndDate>?</com:EndDate>
                    </vis1:Schedule>
                    <!--Optional:-->
                    <vis1:Priority>?</vis1:Priority>
                    <!--Optional:-->
                    <vis1:Origin>?</vis1:Origin>
                    <!--Optional:-->
                    <vis1:SpecialInstructions>?</vis1:SpecialInstructions>
                    <!--Optional:-->
                    <vis1:AdditionalProperties>
                        <!--Zero or more repetitions:-->
                        <vis1:AdditionalProperty>
                            <vis1:Name>?</vis1:Name>
                            <vis1:Value>?</vis1:Value>
                            <!--Optional:-->
                            <vis1:AdditionalProperties/>
                        </vis1:AdditionalProperty>
                    </vis1:AdditionalProperties>
                    <!--Optional:-->
                    <vis1:CatalogueReference>?</vis1:CatalogueReference>
                    <!--Optional:-->
                    <vis1:Lines>
                        <!--Zero or more repetitions:-->
                        <vis1:Line>
                            <vis1:LineNo>?</vis1:LineNo>
                            <!--Optional:-->
                            <vis1:Trade>?</vis1:Trade>
                            <vis1:Type>?</vis1:Type>
                            <!--Optional:-->
                            <vis1:Code>?</vis1:Code>
                            <!--Optional:-->
                            <vis1:Description>?</vis1:Description>
                            <vis1:Quantity>?</vis1:Quantity>
                            <!--Optional:-->
                            <vis1:CompletedQuantity>?</vis1:CompletedQuantity>
                            <!--Optional:-->
                            <vis1:Smv>?</vis1:Smv>
                            <!--Optional:-->
                            <vis1:Price>?</vis1:Price>
                            <!--Optional:-->
                            <vis1:Cash>?</vis1:Cash>
                            <!--Optional:-->
                            <vis1:Complete>?</vis1:Complete>
                            <!--Optional:-->
                            <vis1:Notes>?</vis1:Notes>
                            <!--Optional:-->
                            <vis1:Location>?</vis1:Location>
                        </vis1:Line>
                    </vis1:Lines>
                    <!--Optional:-->
                    <vis1:Tasks>
                        <!--Zero or more repetitions:-->
                        <vis1:Task>
                            <vis1:LineNo>?</vis1:LineNo>
                            <vis1:Type>?</vis1:Type>
                            <vis1:Description>?</vis1:Description>
                            <!--Optional:-->
                            <vis1:Complete>?</vis1:Complete>
                            <!--Optional:-->
                            <vis1:Notes>?</vis1:Notes>
                            <!--Optional:-->
                            <vis1:Location>?</vis1:Location>
                            <vis1:Status>?</vis1:Status>
                            <!--Optional:-->
                            <vis1:AdditionalProperties>
                                <!--Zero or more repetitions:-->
                                <vis1:AdditionalProperty>
                                    <vis1:Name>?</vis1:Name>
                                    <vis1:Value>?</vis1:Value>
                                    <!--Optional:-->
                                    <vis1:AdditionalProperties/>
                                </vis1:AdditionalProperty>
                            </vis1:AdditionalProperties>
                        </vis1:Task>
                    </vis1:Tasks>
                    <!--Optional:-->
                    <vis1:HasPendingTasks>?</vis1:HasPendingTasks>
                    <!--Optional:-->
                    <vis1:Actual>
                        <com:StartDate>?</com:StartDate>
                        <com:EndDate>?</com:EndDate>
                    </vis1:Actual>
                    <!--Optional:-->
                    <vis1:Duration>?</vis1:Duration>
                </vis:Visit>
            </mes:CreateVisitRequest>
        </mes:SendCreateVisitRequestMessage>
    </soapenv:Body>
</soapenv:Envelope>